burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Source/gd32e51x_usart.c
/*!
    \file    gd32e51x_usart.c
    \brief   USART driver

    \version 2024-12-30, V1.2.0, firmware for GD32E51x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/


#include "gd32e51x_usart.h"

/* USART register bit offset */
#define GP_GUAT_OFFSET            ((uint32_t)8U)       /* bit offset of GUAT in USART_GP */
#define CTL2_SCRTNUM_OFFSET       ((uint32_t)17U)       /* bit offset of SCRTNUM in USART_CTL2 */
#define CTL3_SCRTNUM_OFFSET       ((uint32_t)1U)       /* bit offset of SCRTNUM in USART_CTL3 */
#define RT_BL_OFFSET              ((uint32_t)24U)      /* bit offset of BL in USART_RT */

/*!
    \brief      reset USART/UART 
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[out] none
    \retval     none
*/
void usart_deinit(uint32_t usart_periph)
{
    switch(usart_periph){
    case USART0:
        rcu_periph_reset_enable(RCU_USART0RST);
        rcu_periph_reset_disable(RCU_USART0RST);
        break;
    case USART1:
        rcu_periph_reset_enable(RCU_USART1RST);
        rcu_periph_reset_disable(RCU_USART1RST);
        break;
    case USART2:
        rcu_periph_reset_enable(RCU_USART2RST);
        rcu_periph_reset_disable(RCU_USART2RST);
        break;
    case USART5:
        rcu_periph_reset_enable(RCU_USART5RST);
        rcu_periph_reset_disable(RCU_USART5RST);
        break;
    case UART3:
        rcu_periph_reset_enable(RCU_UART3RST);
        rcu_periph_reset_disable(RCU_UART3RST);
        break;
    case UART4:
        rcu_periph_reset_enable(RCU_UART4RST);
        rcu_periph_reset_disable(RCU_UART4RST);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure USART baud rate value
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[in]  baudval: baud rate value
    \param[out] none
    \retval     none
*/ 
void usart_baudrate_set(uint32_t usart_periph, uint32_t baudval)
{
    uint32_t uclk=0U, intdiv=0U, fradiv=0U, udiv=0U;
    switch(usart_periph){
         /* get clock frequency */
    case USART0:
         uclk=rcu_clock_freq_get(CK_APB2);
         break;
    case USART5:
         uclk=rcu_clock_freq_get(CK_USART);
         break;
    case USART1:
         uclk=rcu_clock_freq_get(CK_APB1);
         break;
    case USART2:
         uclk=rcu_clock_freq_get(CK_APB1);
         break;
    case UART3:
         uclk=rcu_clock_freq_get(CK_APB1);
         break;
    case UART4:
         uclk=rcu_clock_freq_get(CK_APB1);
         break;
    default:
         break;
    }

    if(USART5 == usart_periph){
        /* configure USART5 baud rate value */
        if(USART5_CTL0(usart_periph) & USART5_CTL0_OVSMOD){
            /* when oversampling by 8, configure the value of USART_BAUD */
            udiv = ((2U*uclk) + baudval/2U)/baudval;
            intdiv = udiv & 0x0000fff0U;
            fradiv = (udiv>>1) & 0x00000007U;
        }else{
            /* when oversampling by 16, configure the value of USART_BAUD */
            udiv = (uclk+baudval/2U)/baudval;
            intdiv = udiv & 0x0000fff0U;
            fradiv = udiv & 0x0000000fU;
        } 
        USART5_BAUD(usart_periph) = ((USART5_BAUD_FRADIV | USART5_BAUD_INTDIV) & (intdiv | fradiv));
    }else{
        /* configure USARTx(x=0,1,2)/UARTx(x=3,4) baud rate value */
        if(USART_CTL0(usart_periph) & USART_CTL0_OVSMOD){
            /* when oversampling by 8, configure the value of USART_BAUD */
            udiv = ((2U*uclk) + baudval/2U)/baudval;
            intdiv = udiv & 0x0000fff0U;
            fradiv = (udiv>>1) & 0x00000007U;
        }else{
            /* when oversampling by 16, configure the value of USART_BAUD */
            udiv = (uclk+baudval/2U)/baudval;
            intdiv = udiv & 0x0000fff0U;
            fradiv = udiv & 0x0000000fU;
            }
        USART_BAUD(usart_periph) = ((USART_BAUD_FRADIV | USART_BAUD_INTDIV) & (intdiv | fradiv));
    }
}

/*!
    \brief     configure USART parity function
    \param[in] usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[in] paritycfg: configure USART parity
               only one parameter can be selected which is shown as below:
      \arg       USART_PM_NONE: no parity
      \arg       USART_PM_EVEN: even parity 
      \arg       USART_PM_ODD:  odd parity
    \param[out] none
    \retval     none
*/
void usart_parity_config(uint32_t usart_periph, uint32_t paritycfg)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* clear USART5_CTL0 PM,PCEN Bits */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_PM | USART5_CTL0_PCEN);
        /* configure USART5 parity mode */
        USART5_CTL0(usart_periph) |= ((USART5_CTL0_PM | USART5_CTL0_PCEN) & paritycfg); 
    }else{
        /* clear USART_CTL0 PM,PCEN Bits */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_PM | USART_CTL0_PCEN);
        /* configure USARTx(x=0,1,2)/UARTx(x=3,4) parity mode */
        USART_CTL0(usart_periph) |= ((USART_CTL0_PM | USART_CTL0_PCEN) & paritycfg);
    }
}

/*!
    \brief     configure USART word length
    \param[in] usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[in] wlen: USART word length configure
               only one parameter can be selected which is shown as below:
      \arg       USART_WL_8BIT: 8 bits
      \arg       USART_WL_9BIT: 9 bits
    \param[out] none
    \retval     none
*/
void usart_word_length_set(uint32_t usart_periph, uint32_t wlen)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* clear USART5_CTL0 WL bit */
        USART5_CTL0(usart_periph) &= ~USART5_CTL0_WL;
        /* configure USART word length */
        USART5_CTL0(usart_periph) |= (USART5_CTL0_WL & wlen); 
    }else{
        /* clear USART_CTL0 WL bit */
        USART_CTL0(usart_periph) &= ~USART_CTL0_WL;
        /* configure USARTx(x=0,1,2)/UARTx(x=3,4) word length */
        USART_CTL0(usart_periph) |= (USART_CTL0_WL & wlen);
    }
}

/*!
    \brief     configure USART stop bit length
    \param[in] usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[in] stblen: USART stop bit configure
               only one parameter can be selected which is shown as below:
      \arg       USART_STB_1BIT:   1 bit
      \arg       USART_STB_0_5BIT: 0.5 bit(not available for UARTx(x=3,4,6,7))
      \arg       USART_STB_2BIT:   2 bits
      \arg       USART_STB_1_5BIT: 1.5 bits(not available for UARTx(x=3,4,6,7))
    \param[out] none
    \retval     none
*/
void usart_stop_bit_set(uint32_t usart_periph, uint32_t stblen)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* clear USART5_CTL1 STB bits */
        USART5_CTL1(usart_periph) &= ~USART5_CTL1_STB; 
        /* configure USART stop bits */
        USART5_CTL1(usart_periph) |= (USART5_CTL1_STB & stblen);
    }else{
        /* clear USART_CTL1 STB bits */
        USART_CTL1(usart_periph) &= ~USART_CTL1_STB; 
        /* configure USARTx(x=0,1,2)/UARTx(x=3,4) stop bits */
        USART_CTL1(usart_periph) |= (USART_CTL1_STB & stblen);
    }
}

/*!
    \brief      enable USART
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[out] none
    \retval     none
*/
void usart_enable(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* enable USART5 */
        USART5_CTL0(usart_periph) |= USART5_CTL0_UEN;
    }else{
        /* enable USARTx(x=0,1,2)/UARTx(x=3,4) */
        USART_CTL0(usart_periph) |= USART_CTL0_UEN;
    }
}

/*!
    \brief     disable USART
    \param[in] usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[out] none
    \retval     none
*/
void usart_disable(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
    }else{
        /* disable USARTx(x=0,1,2)/UARTx(x=3,4) */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);
    }
}

/*!
    \brief      configure USART transmitter
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[in]  txconfig: enable or disable USART transmitter
                only one parameter can be selected which is shown as below:
      \arg        USART_TRANSMIT_ENABLE: enable USART transmission
      \arg        USART_TRANSMIT_DISABLE: enable USART transmission
    \param[out] none
    \retval     none
*/
void usart_transmit_config(uint32_t usart_periph, uint32_t txconfig)
{
    uint32_t ctl = 0U;

    if(USART5 == usart_periph){
        ctl = USART5_CTL0(usart_periph);
        ctl &= ~USART5_CTL0_TEN;
        ctl |= (USART5_CTL0_TEN & txconfig);
        /* configure USART5 transfer mode */
        USART5_CTL0(usart_periph) = ctl; 
    }else{
        ctl = USART_CTL0(usart_periph);
        ctl &= ~USART_CTL0_TEN;
        ctl |= (USART_CTL0_TEN & txconfig);
        /* configure USARTx(x=0,1,2)/UARTx(x=3,4) transfer mode */
        USART_CTL0(usart_periph) = ctl;
    }
}

/*!
    \brief      configure USART receiver
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[in]  rxconfig: enable or disable USART receiver
                only one parameter can be selected which is shown as below:
      \arg        USART_RECEIVE_ENABLE: enable USART reception
      \arg        USART_RECEIVE_DISABLE: disable USART reception
    \param[out] none
    \retval     none
*/
void usart_receive_config(uint32_t usart_periph, uint32_t rxconfig)
{
    uint32_t ctl = 0U;

    if(USART5 == usart_periph){
        ctl = USART5_CTL0(usart_periph);
        ctl &= ~USART5_CTL0_REN;
        ctl |= (USART5_CTL0_REN & rxconfig);
        /* configure USART5 receive mode */
        USART5_CTL0(usart_periph) = ctl;
    }else{
        ctl = USART_CTL0(usart_periph);
        ctl &= ~USART_CTL0_REN;
        ctl |= (USART_CTL0_REN & rxconfig);
        /* configure USARTx(x=0,1,2)/UARTx(x=3,4) receive mode */
        USART_CTL0(usart_periph) = ctl;
    }
}

/*!
    \brief      configure the USART oversample mode 
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[in]  oversamp: oversample value
                only one parameter can be selected which is shown as below:
      \arg        USART_OVSMOD_8: 8 bits
      \arg        USART_OVSMOD_16: 16 bits
    \param[out] none
    \retval     none
*/
void usart_oversample_config(uint32_t usart_periph, uint32_t oversamp)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* clear OVSMOD bit */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_OVSMOD);
        /* configure the USART5 oversample mode */
        USART5_CTL0(usart_periph) |= (USART5_CTL0_OVSMOD & oversamp);
    }else{
        /* clear OVSMOD bit */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_OVSMOD);
        /* configure the USARTx(x=0,1,2)/UARTx(x=3,4) oversample mode */
        USART_CTL0(usart_periph) |= (USART_CTL0_OVSMOD & oversamp);
    }
}

/*!
    \brief      configure sample bit method
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[in]  obsm: sample bit
                only one parameter can be selected which is shown as below:
      \arg        USART_OSB_1bit: 1 bit
      \arg        USART_OSB_3bit: 3 bits
    \param[out] none
    \retval     none
*/
void usart_sample_bit_config(uint32_t usart_periph, uint32_t obsm)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* clear USART5 OSB bit */
        USART5_CTL2(usart_periph) &= ~(USART5_CTL2_OSB);
        /* configure USART5 sample bit method */
        USART5_CTL2(usart_periph) |= (USART5_CTL2_OSB & obsm);
    }else{
        USART_CTL2(usart_periph) &= ~(USART_CTL2_OSB);
        /* configure USARTx(x=0,1,2)/UARTx(x=3,4) sample bit method */
        USART_CTL2(usart_periph) |= (USART_CTL2_OSB & obsm);
    }
}

/*!
    \brief      enable receiver timeout
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_receiver_timeout_enable(uint32_t usart_periph)
{
    if(USART5 ==usart_periph){
        /* enable receiver timeout of USART5 */
        USART5_CTL1(usart_periph) |= USART5_CTL1_RTEN;
    }else{
        /* enable receiver timeout of USARTx(x=0,1,2) */
        USART_CTL3(usart_periph) |= USART_CTL3_RTEN;
    }
}

/*!
    \brief      disable receiver timeout
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_receiver_timeout_disable(uint32_t usart_periph)
{
    if(USART5 ==usart_periph){
        /* disable receiver timeout of USART5 */
        USART5_CTL1(usart_periph) &= ~USART5_CTL1_RTEN;
    }else{
        /* disable receiver timeout of USARTx(x=0,1,2) */
        USART_CTL3(usart_periph) &= ~(USART_CTL3_RTEN);
    }
}

/*!
    \brief      configure receiver timeout threshold
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[in]  rtimeout: 0x00000000-0x00FFFFFF
    \param[out] none
    \retval     none
*/
void usart_receiver_timeout_threshold_config(uint32_t usart_periph, uint32_t rtimeout)
{
    if(USART5 == usart_periph){
        USART5_RT(usart_periph) &= ~(USART5_RT_RT);
        /* configure USART5 receiver timeout threshold */
        USART5_RT(usart_periph) |= (USART5_RT_RT & rtimeout);
    }else{
        USART_RT(usart_periph) &= ~(USART_RT_RT);
        /* configure USARTx(x=0,1,2) receiver timeout threshold */
        USART_RT(usart_periph) |= (USART_RT_RT & rtimeout);
    }
}

/*!
    \brief      USART transmit data function
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[in]  data: data of transmission 
    \param[out] none
    \retval     none
*/
void usart_data_transmit(uint32_t usart_periph, uint16_t data)
{
    if(USART5 == usart_periph){
        /* USART5 transmit data */
        USART5_TDATA(usart_periph) = USART5_TDATA_TDATA & (uint32_t)data;
    }else{
        /* USARTx(x=0,1,2)/UARTx(x=3,4) transmit data */
        USART_DATA(usart_periph) = USART_DATA_DATA & (uint32_t)data;
    }
}

/*!
    \brief      USART receive data function
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[out] none
    \retval     data of received
*/
uint16_t usart_data_receive(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* USART5 receive data */
        return (uint16_t)(GET_BITS(USART5_RDATA(usart_periph), 0U, 8U));
    }else{
        /* USARTx(x=0,1,2)/UARTx(x=3,4) receive data */
       return (uint16_t)(GET_BITS(USART_DATA(usart_periph), 0U, 8U)); 
    }
}

/*!
    \brief      enable mute mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[out] none
    \retval     none
*/
void usart_mute_mode_enable(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* enable USART5 mute mode */
        USART5_CTL0(usart_periph) |= USART5_CTL0_MEN;
    }else{
        /* enable USARTx(x=0,1,2)/UARTx(x=3,4) mute mode */
        USART_CTL0(usart_periph) |= USART_CTL0_RWU;
    }
}

/*!
    \brief      disable mute mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[out] none
    \retval     none
*/
void usart_mute_mode_disable(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* disable USART5 mute mode */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_MEN);
    }else{
        /* disable USARTx(x=0,1,2)/UARTx(x=3,4) mute mode */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_RWU);
    }
}

/*!
    \brief      configure wakeup method in mute mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[in]  wmethod: two method be used to enter or exit the mute mode
                only one parameter can be selected which is shown as below:
      \arg        USART_WM_IDLE: idle line
      \arg        USART_WM_ADDR: address mask
    \param[out] none
    \retval     none
*/
void usart_mute_mode_wakeup_config(uint32_t usart_periph, uint32_t wmethod)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* clear USART5 WM bit */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_WM);
        /* configure USART5 wakeup method in mute mode */
        USART5_CTL0(usart_periph) |= (USART5_CTL0_WM & wmethod);
    }else{
        /* clear USARTx(x=0,1,2)/UARTx(x=3,4) WM bit */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_WM);
        /* configure USARTx(x=0,1,2)/UARTx(x=3,4) wakeup method in mute mode */
        USART_CTL0(usart_periph) |= (USART_CTL0_WM & wmethod);
    }
}

/*!
    \brief      enable LIN mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[out] none
    \retval     none
*/
void usart_lin_mode_enable(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* enable USART5 LIN mode */
        USART5_CTL1(usart_periph) |= USART5_CTL1_LMEN;
    }else{
        /* enable USARTx(x=0,1,2)/UARTx(x=3,4) LIN mode */
        USART_CTL1(usart_periph) |= USART_CTL1_LMEN;
    }
}

/*!
    \brief      disable LIN mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[out] none
    \retval     none
*/
void usart_lin_mode_disable(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* disable USART5 LIN mode */
        USART5_CTL1(usart_periph) &= ~(USART5_CTL1_LMEN);
    }else{
        /* disable USARTx(x=0,1,2)/UARTx(x=3,4) LIN mode */
        USART_CTL1(usart_periph) &= ~(USART_CTL1_LMEN);
    }
}

/*!
    \brief      configure lin break frame length
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[in]  lblen: lin break frame length
                only one parameter can be selected which is shown as below:
      \arg        USART_LBLEN_10B: 10 bits
      \arg        USART_LBLEN_11B: 11 bits
    \param[out] none
    \retval     none
*/
void usart_lin_break_detection_length_config(uint32_t usart_periph, uint32_t lblen)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);

        USART5_CTL1(usart_periph) &= ~(USART5_CTL1_LBLEN);
        /* configure USART5 lin break frame length */
        USART5_CTL1(usart_periph) |= USART5_CTL1_LBLEN & (lblen);
    }else{
        USART_CTL1(usart_periph) &= ~(USART_CTL1_LBLEN);
        /* configure USARTx(x=0,1,2)/UARTx(x=3,4) lin brek frame length */
        USART_CTL1(usart_periph) |= (USART_CTL1_LBLEN & lblen);
    }
}

/*!
    \brief      enable half-duplex mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[out] none
    \retval     none
*/
void usart_halfduplex_enable(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* enable USART5 half duplex mode */
        USART5_CTL2(usart_periph) |= (USART5_CTL2_HDEN);
    }else{
        /* enable USARTx(x=0,1,2)/UARTx(x=3,4) half duplex mode */
        USART_CTL2(usart_periph) |= USART_CTL2_HDEN;
    }
}

/*!
    \brief      disable half-duplex mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)/UARTx(x=3,4)
    \param[out] none
    \retval     none
*/
void usart_halfduplex_disable(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* disable USART5 half duplex mode */
        USART5_CTL2(usart_periph) &= ~(USART5_CTL2_HDEN);
    }else{
        /* disable USARTx(x=0,1,2)/UARTx(x=3,4) half duplex mode */
        USART_CTL2(usart_periph) &= ~(USART_CTL2_HDEN);
    }
}

/*!
    \brief      enable CK pin in synchronous mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_synchronous_clock_enable(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* enable USART5 CK pin in synchronous mode */
        USART5_CTL1(usart_periph) |= USART5_CTL1_CKEN;
    }else{
        /* enable USARTx(x=0,1,2) CK pin in synchronous mode */
        USART_CTL1(usart_periph) |= USART_CTL1_CKEN;
    }
}

/*!
    \brief      disable CK pin in synchronous mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_synchronous_clock_disable(uint32_t usart_periph)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        /* disable USART5 CK pin in synchronous mode */
        USART5_CTL1(usart_periph) &= ~(USART5_CTL1_CKEN);
    }else{
        /* disable USARTx(x=0,1,2) CK pin in synchronous mode */
        USART_CTL1(usart_periph) &= ~(USART_CTL1_CKEN);
    }
}

/*!
    \brief      configure USART synchronous mode parameters
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[in]  clen: CK length
                only one parameter can be selected which is shown as below:
      \arg        USART_CLEN_NONE: there are 7 CK pulses for an 8 bit frame and 8 CK pulses for a 9 bit frame 
      \arg        USART_CLEN_EN:   there are 8 CK pulses for an 8 bit frame and 9 CK pulses for a 9 bit frame
    \param[in]  cph: clock phase
                only one parameter can be selected which is shown as below:
      \arg        USART_CPH_1CK: first clock transition is the first data capture edge 
      \arg        USART_CPH_2CK: second clock transition is the first data capture edge
    \param[in]  cpl: clock polarity
                only one parameter can be selected which is shown as below:
      \arg        USART_CPL_LOW:  steady low value on CK pin 
      \arg        USART_CPL_HIGH: steady high value on CK pin
    \param[out] none
    \retval     none
*/
void usart_synchronous_clock_config(uint32_t usart_periph, uint32_t clen, uint32_t cph, uint32_t cpl)
{
    if(USART5 == usart_periph){
        /* disable USART5 */
        USART5_CTL0(usart_periph) &= ~(USART5_CTL0_UEN);
        
